Autodesk.Revit.DB.Events.FailuresProcessingEventArgs.GetFailuresAccessor
Provides access to the failure information in the document.
Returns:
The accessor to the failures in the document.
Since:
2011

Autodesk.Revit.DB.Events.FailuresProcessingEventArgs.GetProcessingResult
Retrieves current status of the failures processing result.
Returns:
The current failures processing result.
Since:
2011

Autodesk.Revit.DB.Events.FailuresProcessingEventArgs.SetProcessingResult(Autodesk.Revit.DB.FailureProcessingResult)
Sets the result of the failures processing accomplished during this event callback.
Remarks:
If this value is not explicitly set, the default value (Continue) will be used.  If the event callback
is resolving errors explicitly, it must be set to ProceedWithCommit - see the remarks for the
Autodesk.Revit.DB.Events.FailuresProcessingEventArgs object for more details.
Note that ProceedWithCommit should not be set if the handler has not resolved any errors - the
handler will be called again as a result of the commit request and Revit failure handling will
never be reached.
Setting this result may not affect the outcome if other observers of the event are invoked after this one.
The most prohibitive result set by all handlers will be used.
result:
The result.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Events.FailuresProcessingEventArgs
The event arguments used by the FailuresProcessing event.
Remarks:
The event arguments provide access to the FailuresAccessor via Autodesk.Revit.DB.Events.FailuresProcessingEventArgs.GetFailuresAccessor
which contains the details of the errors and/or warnings that caused the event to trigger.
The arguments also allow you to set a processing result
via Autodesk.Revit.DB.Events.FailuresProcessingEventArgs.SetProcessingResult(Autodesk.Revit.DB.FailureProcessingResult).  The processing result determines if Revit will attempt to
recommit the currently failing transaction,  roll it back, or continue.  If you are explicitly
dismissing warnings from the event callback, a processing result of Continue is sufficient.  But if you
are explicitly resolving errors from the event callback, you must change the processing result to ProceedWithCommit
to ensure that the user is not shown the dismissed errors.   If you wish to cancel the transaction
silently without showing the errors to the user, set the processing result to ProceedWithRollback, however
you must also call Autodesk.Revit.DB.FailureHandlingOptions.SetClearAfterRollback(System.Boolean) in
order to dismiss the errors and silently cancel the transaction.
Since:
2011